 ### Terraform Component 🧱: `aws-analytical-platform-development-jupyterhub`
#### Terraform Initialization ⚙️: `success`
#### Terraform Validation 🤖: `success`

<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Static Analysis 🛂

Checkov: `success`

tfsec: `success`

#### Terraform Plan 📖: `success`

<details><summary>Plan Output</summary>

```

Acquiring state lock. This may take a few moments...
data.aws_caller_identity.session: Reading...
data.aws_caller_identity.session: Read complete after 1s [id=042130406152]
data.aws_iam_session_context.session: Reading...
data.aws_route53_zone.data_platform_moj_woffenden_dev: Reading...
data.aws_eks_cluster.open_metadata: Reading...
aws_acm_certificate.jupyterhub: Refreshing state... [id=arn:aws:acm:eu-west-2:525294151996:certificate/65d39363-1b83-4742-a7d3-1586207919f6]
data.aws_vpcs.open_metadata: Reading...
data.aws_secretsmanager_secret.auth0: Reading...
data.aws_caller_identity.current: Reading...
data.aws_iam_session_context.session: Read complete after 0s [id=arn:aws:sts::042130406152:assumed-role/GlobalGitHubActionAccess/GitHubActions]
data.aws_caller_identity.current: Read complete after 0s [id=525294151996]
data.aws_vpcs.open_metadata: Read complete after 1s [id=eu-west-2]
data.aws_vpc.open_metadata: Reading...
data.aws_secretsmanager_secret.auth0: Read complete after 1s [id=arn:aws:secretsmanager:eu-west-2:525294151996:secret:jupyterhub/auth0-crCf7P]
data.aws_secretsmanager_secret_version.auth0: Reading...
data.aws_eks_cluster.open_metadata: Read complete after 1s [id=open-metadata]
data.aws_secretsmanager_secret_version.auth0: Read complete after 0s [id=arn:aws:secretsmanager:eu-west-2:525294151996:secret:jupyterhub/auth0-crCf7P|AWSCURRENT]
data.aws_route53_zone.data_platform_moj_woffenden_dev: Read complete after 1s [id=Z0071145I5MOYSFNGEEZ]
aws_route53_record.jupyterhub_acm_validation["hub.data-platform.moj.woffenden.dev"]: Refreshing state... [id=Z0071145I5MOYSFNGEEZ__afbdee159c36a1be036c76d4c9a394c5.hub.data-platform.moj.woffenden.dev._CNAME]
aws_acm_certificate_validation.jupyterhub: Refreshing state... [id=2023-07-21 13:52:28.078 +0000 UTC]
data.aws_vpc.open_metadata: Read complete after 1s [id=vpc-08776fe59faa43d98]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # helm_release.jupyterhub will be created
  + resource "helm_release" "jupyterhub" {
      + atomic                     = false
      + chart                      = "jupyterhub"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "jupyterhub"
      + namespace                  = "jupyterhub"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://jupyterhub.github.io/helm-chart/"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 600
      + values                     = [
          + (sensitive value),
        ]
      + verify                     = false
      + version                    = "2.0.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # kubernetes_namespace.jupyterhub will be created
  + resource "kubernetes_namespace" "jupyterhub" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "jupyterhub"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @jhackett-ap, Action: `pull_request`, Working Directory: `terraform/aws/analytical-platform-development/jupyterhub`, Workflow: `Terraform`*